# Отчет по лабораторной работе № 15
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Федорова Екатерина Васильевна

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Обработка матриц
2. **Цель работы**: Попрактиковаться в работе с матрицами
3. **Задание (вариант №14)**:
﻿
Составить программу на языке С, производящую обработку квадратной матрицы порядка NxN (1≤N≤8), из целых чисел,
вводимой из стандартного входного текстового файла. Тестирование провести для пакета тестов из нескольких матриц
различного порядка, корректно завершающегося концом этого файла.

Задание варианта: умножить элементы верхнетреугольной подматрицы на минимальный элемент нижнетреугольной подматрицы и вывести новую матрицу.

4. **Идея, метод, алгоритм решения задачи**: 
- считать порядок матрицы
- создать и заполнить матрицу элементами
- из нижнетреугольной матрицы найти минимальный элемент
- элементы верхнетреугольной матрицы умножить на сохранённый минимальный элемент
- вывести новую матрицу
5. **Сценарий выполнения работы**: 

Тест №1. Порядок 1.
```
moscow@moscow:~/Рабочий стол/For Labs/ForLabs/Lab15$ ./a.out
1
4
16
```


Тест №2. Порядок 2.
```
moscow@moscow:~/Рабочий стол/For Labs/ForLabs/Lab15$ ./a.out
2
2 3
4 5

4 6 
4 10 
```


Тест №3. Порядок 8.
```
moscow@moscow:~/Рабочий стол/For Labs/ForLabs/Lab15$ ./a.out
8
10 10 10 10 10 10 10 10 
9 9 9 9 9 9 9 9
8 8 8 8 8 8 8 8
7 7 7 7 7 7 7 7
6 6 6 6 6 6 6 6
5 5 5 5 5 5 5 5
6 6 6 6 6 6 6 6
7 7 7 7 7 7 7 7

50 50 50 50 50 50 50 50 
9 45 45 45 45 45 45 45 
8 8 40 40 40 40 40 40 
7 7 7 35 35 35 35 35 
6 6 6 6 30 30 30 30 
5 5 5 5 5 25 25 25 
6 6 6 6 6 6 30 30 
7 7 7 7 7 7 7 35 
```

6. **Протокол**:

Программа:
```
#include <stdio.h>

int main(void){
    int order = 0;
    scanf("%d", &order);
    int matrix[order][order];
    int line = 0, column = 0, min_elem = 10000000;
    if(order == 1){
        scanf("%d", &matrix[0][0]);
        printf("%d\n", matrix[0][0]*matrix[0][0]);
    }
    else{
        for(int i = 0; i < order; i++){
            for (int j = 0; j < order; j++){
                scanf("%d", &matrix[i][j]);
            }
        }
        
        printf("\n");
        for(line = 0; line<order; line++){
            for(column = 0; column<order; column++){
                if((line >= column) && (min_elem > matrix[line][column])){
                    min_elem = matrix[line][column];
                }
            }
        }
        
        for(line = 0; line<order; line++){
            for(column = 0; column<order; column++){
                if(line <= column){
                    matrix[line][column]*=min_elem;
                }
            }
        }
        
        for(line = 0; line<order; line++){
            for(column = 0; column<order; column++){
                printf("%d ", matrix[line][column]);
            }
            printf("\n");
        }
    }    
        
    
    return 0;
}
```
7. **Замечания автора** по существу работы: -.
8. **Выводы**: Слышала часто, что эта лабораторная вызывала у людей ужас, однако по ходу выполнения я поняла, что боятся её совершенно не стоит.
Работа далась даже легче предыдущей, я насладилась составлением незамысловатой программы, хотя всё ещё разочарована возможностями языка С по сравнению с
Python. Заметила, что языки программирования по восприятию мозга имеют схожести с обычными языками: сначала даются сложно, так как основываешься на своём первом,
родном языке, "переводишь" с него на новый. Позже учишься перестраивать сознание: и вот мышление на разных языках тоже становится разным, как и "характер",
как и "авторский почерк" (стиль). Считаю это наблюдение довольно любопытным.
